package com.jfl.pas2.constant.error;

import com.jfl.pas2.application.AppExceptionAssert;
import lombok.AllArgsConstructor;
import lombok.Getter;

/**
 * @author Bin Liu
 * @date 2021-07-05-5:50 PM
 */

@Getter
public enum ErrorEnum implements AppExceptionAssert {

    E00001("E00001", "用户名不可为空!"),
    E00002("E00002", "密码不可为空!"),
    E00003("E00003", "电话号码不可为空！"),
    E00004("E00004", "权限级别不可为空！"),
    E00005("E00005", "用户已存在，无需重复注册！"),
    E00006("E00006", "查询用户信息出错！"),
    E00007("E00007", "写入账号信息表出错！"),
    E00008("E00008", "用户号输入不合法！"),
    E00009("E00009", "查询用户信息出错！"),
    E00010("E00010", "是否记住密码标志输入有误！"),
    E00011("E00011", "是否自动登录标志输入有误！"),
    E00012("E00012", "用户号输入不可为空！"),
    E00013("E00013", "新密码不可为空！"),
    E00014("E00014", "您输入的手机号与已录入手机号不符，请重新输入！"),
    E00015("E00015", "新密码不可与旧密码相同，请重新输入！"),
    E00016("E00016", "产品型号输入不可为空！"),
    E00017("E00017", "产品名称输入不可为空！"),
    E00018("E00018", "品牌名称输入不可为空！"),
    E00019("E00019", "产品尺寸输入不可为空！"),
    E00020("E00020", "产品颜色输入不可为空！"),
    E00021("E00021", "叶片规格输入不可为空！"),
    E00022("E00022", "立柱规格输入不可为空！"),
    E00023("E00023", "电机规格输入不可为空！"),
    E00024("E00024", "成本价格输入不合法！"),
    E00025("E00025", "产品编号不可为空！"),
    E00026("E00026", "写产品信息文件出错！"),
    E00027("E00027", "用户号不可为空！"),
    E00028("E00027", "用户号不存在！"),
    E00029("E00029", "产品代码输入不可为空！"),
    E00030("E00030", "查询条件输入不可为空！"),
    E00031("E00031", "查询参数输入不可为空！"),
    E00032("E00032", "查询产品信息文件出错！"),
    E00033("E00033", "产品数量不可为空！"),
    E00034("E00034", "请确认是否带有风杯！"),
    E00035("E00035", "请确认是否带有调速器！"),
    E00036("E00036", "请确认是否带有中环！"),
    E00037("E00037", "更新产品信息文件出错！"),
    E00038("E00038", "出现产品编号不存在，请认真核对！"),
    E00039("E00039", "出现产品库存不足，请认真核对！"),
    E00040("E00040", "入库单号输入不可为空！"),
    E00041("E00041", "写操作明细文件出错！"),
    E00042("E00042", "出库单号输入不可为空！"),
    E00043("E00043", "开始日期不可大于结束日期！"),
    E00044("E00044", "查询操作明细文件出错！"),
    ;


    /**
     * 返回码
     */
    private String code;
    /**
     * 返回消息
     */
    private String message;

    ErrorEnum(String code, String causes) {
        this.code = code;
        this.message = causes;
    }

    @Override
    public String getCode() {
        return code;
    }

    @Override
    public String getMessage() {
        return message;
    }
}
